src/Catalogs/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСделки</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаУспех</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницыПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыПациентовПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусПациента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныОтказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВариантыДействийТриггерныхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыДействийТриггерныхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправитьСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаМенеджеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеPUSH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовыситьЭтапСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СменитьЭтапСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеВМесенджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктивироватьЧатБота</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ЭтапыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыСделок/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий 
// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПричиныОтказов) Тогда
	//	Отказ = Истина;
	//	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Укажите причину отказа';en='Specify the reason for refusal'")
	//										, 
	//										, "Объект.ПричиныОтказов[0].ПричинаОтказа");
	//	Возврат;
	//КонецЕсли;
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	АктуализироватьЭтапыВидаСделки();
	АктуализироватьТриггерныеСобытия();
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Актуализировать этапы вида сделки
//
Процедура АктуализироватьЭтапыВидаСделки()
	
	Если ДополнительныеСвойства.Свойство("ЭтапыСделок") Тогда 
		ЭтапыСделок = ДополнительныеСвойства.ЭтапыСделок;
		КоличествоСтрок = ЭтапыСделок.Количество();
		ЭтапыСделок.Удалить(КоличествоСтрок - 1);
		
		Для Каждого СтрокаТЗ Из ЭтапыСделок Цикл
			
			Цвет = ?(ЗначениеЗаполнено(СтрокаТЗ.Цвет), СтрокаТЗ.Цвет, ЗначениеВСтрокуВнутр(Новый Цвет));
			
			Если НЕ СтрокаТЗ.Ссылка.Пустая() Тогда
				
				СтарыйЭтапОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
				СтарыйЭтапОбъект.Наименование = СтрокаТЗ.Наименование;
				СтарыйЭтапОбъект.ЦветЭтапа	  = Цвет;
				СтарыйЭтапОбъект.НомерЭтапа	  = ЭтапыСделок.Индекс(СтрокаТЗ) + 1;
				СтарыйЭтапОбъект.Записать();
				
			Иначе
				
				НовыйЭтап = Справочники.ЭтапыСделок.СоздатьЭлемент();
				НовыйЭтап.ВидСделки    = Ссылка;
				НовыйЭтап.НомерЭтапа   = ЭтапыСделок.Индекс(СтрокаТЗ) + 1;
				НовыйЭтап.ЦветЭтапа    = Цвет;
				НовыйЭтап.Наименование = СтрокаТЗ.Наименование;
				НовыйЭтап.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Актуализировать триггерные события
//
Процедура АктуализироватьТриггерныеСобытия()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Сбрасываем неактуальные этапы в триггерах
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыСделок.Ссылка КАК Этап
	               |ПОМЕСТИТЬ ТаблицаЭтапов
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.ВидСделки = &ВидСделки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЭтапыСделок.Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.Предопределенный = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТриггерныеСобытия.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТриггерныеСобытия КАК ТриггерныеСобытия
	               |ГДЕ
	               |	ТриггерныеСобытия.ЭтоГруппа = ЛОЖЬ
	               |	И ТриггерныеСобытия.Действия.ВидДействия В (ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки), ЗНАЧЕНИЕ(Перечисление.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки))
	               |	И ТриггерныеСобытия.Действия.ВидСделки = &ВидСделки
	               |	И НЕ ТриггерныеСобытия.Действия.ЭтапСделки = ЗНАЧЕНИЕ(Справочник.ЭтапыСделок.ПустаяСсылка)
	               |	И НЕ ТриггерныеСобытия.Действия.ЭтапСделки В
	               |				(ВЫБРАТЬ
	               |					ТаблицаЭтапов.Этап
	               |				ИЗ
	               |					ТаблицаЭтапов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТриггерныеСобытия.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЭтапов.Этап КАК Этап
	               |ИЗ
	               |	ТаблицаЭтапов КАК ТаблицаЭтапов";
	
	Запрос.УстановитьПараметр("ВидСделки", Ссылка);
	ПакетЗапросов 		= Запрос.ВыполнитьПакет();
	МассивЭтапов 		= ПакетЗапросов[2].Выгрузить().ВыгрузитьКолонку("Этап");	
	ВыборкаТриггеров 	= ПакетЗапросов[1].Выбрать();
	Пока ВыборкаТриггеров.Следующий() Цикл 
		Триггер_Объект = ВыборкаТриггеров.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаДействие Из Триггер_Объект.Действия Цикл
			Если СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.ПовыситьЭтапСделки ИЛИ СтрокаДействие.ВидДействия = Перечисления.ВариантыДействийТриггерныхСобытий.СменитьЭтапСделки Тогда 
				Если СтрокаДействие.ВидСделки = Ссылка И МассивЭтапов.Найти(СтрокаДействие.ЭтапСделки) = Неопределено Тогда 
					СтрокаДействие.ЭтапСделки = Справочники.ЭтапыСделок.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		Триггер_Объект.ОбменДанными.Загрузка = Истина;
		Триггер_Объект.Записать();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	




#КонецОбласти
